//================================================================================================================
//
// DirectXのエディタ用のヘッダーファイル [editer.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _EDITER_H_
#define _EDITER_H_

#include "main.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** エディタ用構造体 ***
//**********************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXCOLOR col;			// 色
	float fWidth;			// 幅
	float fHeight;			// 高さ
	bool bUse;				// 使用しているか
}BLOCKFROMEDIT;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitEditer(void);								// エディタの初期化
void UninitEditer(void);							// 終了
void UpdateEditer(void);							// 更新
void DrawEditer(void);								// 描画
			
void SetEnableDebugPlay(bool bUse);					// デバッグプレイの有効化
bool GetDebugPlay(void);							// デバッグプレイ状態の取得
void SetEnableChanged(bool bChanged);				// データの変化
BLOCKFROMEDIT *GetEditerInfo(void);					// エディタにて設置したブロックの情報


#endif